app/controllers/school_classes_controller.rb

  def create
    @schoolclass = SchoolClass.new(school_class_params)
    @schoolclass.save
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Computer Science"], ["room_number", 5]]

  def update
    @schoolclass = SchoolClass.find(params[:id])
    @schoolclass.update(school_class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["id", 1]]